# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
network =input('Введите ip адрес в формате 10.1.1.0/24 : ')
ip=str(list(network.split('/'))[0]).split('.')
mask=int(list(network.split('/'))[1])
mask2=str("1"*mask+"0"*(32-mask))
ip_template = '''
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
'''
mask_template = f'''
Mask:
{mask}
{int(mask2[0:8],2)} {int(mask2[8:16],2)} {int(mask2[16:24],2)} {int(mask2[24:32],2)}
{mask2[0:8]} {mask2[8:16]} {mask2[16:24]} {mask2[24:32]}
'''

print(ip_template.format(int(ip[0]),int(ip[1]),int(ip[2]),int(ip[3])))
print(mask_template)
